# DividedSurfaceDisplayOriginalSurface Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..DividedSurfaceDisplayOriginalSurface Property
ParameterTypeId Class See Also
---
"Surface"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId DividedSurfaceDisplayOriginalSurface { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DividedSurfaceDisplayOriginalSurface As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DividedSurfaceDisplayOriginalSurface {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace